---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FolderItemInfo Properties
FolderItemInfo Class See Also Send Feedback
---

The FolderItemInfo type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The folder parameter Id |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The folder name |

# See Also

FolderItemInfo Class

Autodesk.Revit.DB Namespace